#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/private-henrique-percu/github-actions/runs/run-qkhL4SQQraRRJHQt

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_cluster.demo_ecs_cluster will be created
  + resource "aws_ecs_cluster" "demo_ecs_cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "demo_ecs_cluster"
      + tags               = {
          + "Env"  = "demo"
          + "Name" = "demo_ecs_cluster"
        }
      + tags_all           = {
          + "Env"  = "demo"
          + "Name" = "demo_ecs_cluster"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @HenriquePercu, Action: `pull_request`*